Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh1-6-v3.tmx
Source language: bo
Languages: en

source: འོན་ཀྱང་ངའི་སྦྱིན་པ་དེ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་ པའི་བྱང་ཆུབ་ཀྱི་རྒྱུ་ཙམ་དང་། རྐྱེན་ཙམ་དང་། ཚོགས་ཙམ་ཡིན་ནོ།
en: these donations of mine were only a cause, only a condition, only a preparation for supreme and complete awakening.” 6.

source: །རྒྱལ་པོ་ཆེན་པོ་གཞན་ཡང་ངས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་དོན་དུ་གཉེར་བའི་ཕྱིར་སྦྱིན་པ་དག་བཏང་བསོད་ནམས་དག་བྱས་པ་གང་ཡིན་པ་དེ་ཉོན་ཅིག །རྒྱལ་པོ་ཆེན་པོ་སྔོན་བྱུང་བ་ཡུལ་མི་ཐི་ལར་རྒྱལ་པོ་ལྷ་ཆེན་པོ་ཞེས་བྱ་བ་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་མཐའ་བཞིར་རྣམ་པར་རྒྱལ་བ་ཆོས་དང་ལྡན་པ་ཆོས་ཀྱི་རྒྱལ་པོ་རིན་པོ་ཆེ་སྣ་བདུན་དང་ལྡན་པ་ཞིག་བྱུང་སྟེ།
en: Mahādeva “Great King, again, seeking supreme and complete awakening, I gave donations and made merit. Listen to that story. “Great King, once in Mithilā there appeared a king named Mahādeva, a wheel-turning king who had conquered the border regions in the four directions, a righteous Dharma king who had attained the seven treasures.

source: འཁོར་ལོ་རིན་པོ་ཆེ་དང་། གླང་པོ་རིན་པོ་ཆེ་དང་། རྟ་རིན་པོ་ཆེ་དང་། ནོར་བུ་རིན་པོ་ཆེ་དང་། བུད་མེད་རིན་པོ་ཆེ་དང་། ཁྱིམ་བདག་རིན་པོ་ཆེ་དང་། བདུན་པ་བློན་པོ་རིན་པོ་ཆེའོ།
en: the precious chakra, elephant, horse, jewel, woman, householder, and minister.

source: །དེ་ལ་བུ་དཔའ་བ་རྟུལ་ཕོད་པ། ཡན་ལག་མཆོག་གི་གཟུགས་དང་ལྡན་པ། ཕ་རོལ་གྱི་སྡེ་རབ་ཏུ་འཇོམ་པ་སྟོང་ཡང་ཚང་བར་ཡོད་ཅིང་།
en: He also had a thousand sons who were brave, bold, and endowed with excellent physiques, and who would defeat the enemy’s army.

source: དེ་རྒྱ་མཚོ་ལ་ཐུག་པའི་ས་ཆེན་པོ་མ་ལུས་པར་གནོད་པར་སྡོ་བ་མེད་ཅིང་འཚེ་བ་མེད་པ་འདི་ཉིད་ཆད་པ་མེད་ཅིང་མཚོན་གྱིས་བདའ་བ་མེད་ལ་ཆོས་དང་མཐུན་ཞིང་སྙོམས་པས་ལེགས་པར་ཕབ་སྟེ་གནས་སོ།
en: He conquered the land entirely, as far as the seashore, without risking harm, without violence, without punishment or weapons, but in accord with the Dharma and impartially.

source: །དེ་ནས་རྒྱལ་པོ་ལྷ་ཆེན་པོའི་སྐྲ་མཁན་གྱི་མི་སྐྲ་དང་ཁ་སྤུ་འཆོས་པ་ན་སྐྲ་མཁན་གྱི་མི་ལ་སྨྲས་པ། །ཀྱེ་ནང་རྗེ་ཁྱོད་ཀྱིས་གང་གི་ཚེ་ངའི་མགོ་ལས་གཤིན་རྗེའི་ཕོ་ཉ་སྐྲ་དཀར་སྐྱེས་པ་མཐོང་བ་དེའི་ཚེ་ང་ལ་སྦྲོན་ཅིག །ལྷ་བཀའ་བཞིན་འཚལ་ཞེས་སྐྲ་མཁན་གྱི་མིས་རྒྱལ་པོ་ལྷ་ཆེན་པོའི་ལྟར་མཉན་ཏོ།
en: “Then, when a barber was arranging King Mahādeva’s hair and beard, the king ordered him, ‘My man, when you find Yama’s messengers, white hairs, growing on my head, let me know.’

source: །དུས་གཞན་ཞིག་ན་སྐྲ་མཁན་གྱི་མིས་རྒྱལ་པོ་ལྷ་ཆེན་པོའི་སྐྲ་དང་ཁ་སྤུ་འཆོས་པ་ན་རྒྱལ་པོ་ལྷ་ཆེན་པོའི་མགོ་ལས་གཤིན་རྗེའི་ཕོ་ཉ་སྐྲ་དཀར་སྐྱེས་པ་མཐོང་ངོ་།
en: “ ‘Certainly, Your Majesty,’ replied the barber to King Mahādeva. “One day when the barber was arranging King Mahādeva’s hair and beard, he did find Yama’s messengers, white hairs, growing on King Mahādeva’s head.

source: །མཐོང་ནས་ཀྱང་ཡང་རྒྱལ་པོ་ལྷ་ཆེན་པོ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ལྷ་མཁྱེན་པར་མཛོད་ཅིག །དབུ་ལ་གཤིན་རྗེའི་ཕོ་ཉ་དབུ་སྐྲ་དཀར་པོ་སྐྱེས་ལགས་སོ།
en: Having found them, he said to King Mahādeva, ‘Your Majesty, please be informed that Yama’s messengers, white hairs, are growing on your head.’

source: །ཀྱེ་ནང་རྗེ་དེའི་ཕྱིར་ཁྱོད་ཀྱིས་སྐྲ་དཀར་དེ་དག་རིམ་གྱིས་དལ་བུས་དལ་བུས་ཕྱུང་ལ་ངའི་ལག་པར་བྱིན་ཅིག །ལྷ་བཀའ་བཞིན་འཚལ་ཞེས་སྐྲ་མཁན་གྱི་མིས་རྒྱལ་པོ་ལྷ་ཆེན་པོའི་ལྟར་མཉན་ནས་སྐྲ་སྐྱ་བོ་དེ་དག་གསེར་གྱི་སྨང་ཙེར་གྱིས་རིམ་གྱིས་དལ་བུས་དལ་བུས་ཕྱུང་ནས་རྒྱལ་པོ་ལྷ་ཆེན་པོའི་ལག་ཏུ་བཞག་གོ།
en: “ ‘My man, then gently pull out those white hairs without cutting them and place them in my palm.’ “ ‘Certainly, Your Majesty,’ replied the barber to King Mahādeva, and he gently pulled out the white hairs with a pair of golden tweezers one by one and placed them in King Mahādeva’s palm.

source: །དེ་ནས་རྒྱལ་པོ་ལྷ་ཆེན་པོས་སྐྲ་སྐྱ་བོ་དེ་དག་ལག་པ་གཉིས་ཀྱིས་བརྐྱང་ནས་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ།
en: “Holding the white hairs in both his hands, King Mahādeva then spoke a verse:

source: བདག་གི་མགོ་ལས་ཀླད་ཀྱི་སྐྲ། །ལང་ཚོ་འཕྲོག་པ་སྐྱེས་པ་ནི།
en: “ ‘On my head, Hairs that plunder youth are growing.

source: །གཤིན་རྗེའི་ཕོ་ཉ་བྱུང་གྱུར་གྱིས།
en: Since Yama’s messengers have now appeared,

source: །བདག་ནི་རབ་འབྱུང་དུས་ལ་བབ།
en: It is time for me to go forth.

source: །བདག་གིས་མི་རྣམས་ཀྱི་འདོད་པ་ནི་སྤྱད་ཟིན་ཏེ། ལྷ་རྣམས་ཀྱི་འདོད་པ་བཙལ་བའི་དུས་ལ་བབ་ཀྱིས།
en: “ ‘Since I have enjoyed human desires, it is time for me to seek divine desires.

source: མ་ལ་བདག་གིས་གཞོན་ནུ་ཐུ་བོ་རྒྱལ་སྲིད་ཀྱི་དབང་ཕྱུག་ལ་དབང་བྱེད་དུ་བཅུག་ལ་རྒྱལ་པོའི་དྲང་སྲོང་གི་ཚངས་པར་སྤྱོད་པ་སྤྱད་དོ་སྙམ་མོ།
en: Now I will put my eldest son upon the throne and lead the pure life of a royal ṛṣi.’

source: །དེ་ནས་རྒྱལ་པོ་ལྷ་ཆེན་པོས་གཞོན་ནུ་ཐུ་བོ་ཤོས་ཕོ་ཉས་བཀུག་ནས་འདི་སྐད་ཅེས་སྨྲས་སོ། །གཞོན་ནུ་ཤེས་པར་གྱིས་ཤིག །ངའི་མགོ་ལས་གཤིན་རྗེའི་ཕོ་ཉ་སྐྲ་དཀར་སྐྱེས་ཏེ།
en: “Thereupon King Mahādeva summoned his eldest son by messenger and said, ‘Understand, my son, that Yama’s messengers, white hairs, are growing on my head.

source: ངས་མི་རྣམས་ཀྱི་འདོད་པ་ནི་སྤྱད་ཟིན་པས་ལྷ་རྣམས་ཀྱི་འདོད་པ་བཙལ་བའི་དུས་ལ་བབ་སྟེ།
en: Since I have enjoyed human desires, it is time for me to seek divine desires.

source: བུ་གཞོན་ནུ་ཁྱོད་ལ་ངས་རྒྱ་མཚོ་ལ་ཐུག་པའི་ས་ཆེན་པོ་འདི་གཏད་ཀྱིས། ཁྱོད་ཀྱིས་འདི་ལ་ཆོས་བཞིན་གྱིས་བསྐྱང་བར་བྱའི་ཆོས་མ་ཡིན་པས་ནི་མ་ཡིན་ནོ།
en: My son, I will entrust you with the land as far as the seashore, so you should protect it lawfully, not unlawfully.

source: །འགའ་ཞིག་ཆོས་མ་ཡིན་པ་སྤྱོད་དམ་འདྲེན་པར་སྤྱོད་ན་ཁྱོད་ཀྱིས་ཡུལ་དུ་གནས་སུ་མ་གཞུག་ཅིག །བུ་གཞོན་ནུ་ཁྱོད་ཀྱིས་ཀྱང་གང་གི་ཚེ་མགོ་ལ་གཤིན་རྗེའི་ཕོ་ཉ་སྐྲ་དཀར་སྐྱེས་པར་མཐོང་བ་དེའི་ཚེ་ཁྱོད་ཀྱིས་ཀྱང་གཞོན་ནུ་ཐུ་བོ་ཤོས་རྒྱལ་སྲིད་ཀྱི་དབང་ཕྱུག་ལ་དབང་བྱེད་དུ་ཆུག་ལ་རྒྱལ་པོའི་དྲང་སྲོང་གི་ཚངས་པར་སྤྱད་པ་སྤྱོད་ཅིག །ཅི་ནས་ཀྱང་ཁྱོད་ཀྱིས་དགེ་བའི་ལམ་ངེས་པ་འདི་ལྟ་བུ་ལ་ཞུགས་པའི་རྗེས་སུ་འཇུག་པར་བྱའི།
en: If someone’s conduct is unlawful or a mixture of lawful and unlawful, do not let him live in your country. “ ‘My son, when you too find Yama’s messengers, white hairs, growing on your head, you too should put your eldest son upon the throne and lead the pure life of a royal ṛṣi. Thus, my son, you should complete this virtuous and sure path introduced by me, and you should not break the tradition.

source: རྒྱུན་ཆད་པར་མི་བྱ་ཞིང་སྐྱེས་བུ་ཐ་ཤལ་དུ་གྱུར་པར་མི་བྱའོ།
en: You should not be an inferior man.

source: །བུ་གཞོན་ནུ་འགའ་ཞིག་སྐྱེས་བུ་བཟང་པོ་ཡོད་པའི་དུས་འདི་ལྟ་བུ་ལ་དགེ་བའི་ལམ་ངེས་པ་འདི་ལྟ་བུ་ལ་ཞུགས་པའི་རྗེས་སུ་འཇུག་པར་བྱེད་པ་གང་ཡིན་པ་དེ་ནི་དེ་རྣམས་ཀྱི་རྒྱུན་ཆད་པར་མི་བྱེད་པ་ཡིན།
en: “ ‘My son, he who lets such a virtuous and sure path, once introduced at such a time as when there were good men, increase will not be the one who breaks their tradition.

source: དེ་ནི་དེ་རྣམས་ཀྱི་སྐྱེས་བུ་ཐ་ཤལ་མ་ཡིན་པར་འགྱུར་རོ།
en: He will not be an inferior man among them.

source: །བུ་གཞོན་ནུ་འགའ་ཞིག་སྐྱེས་བུ་བཟང་པོ་ཡོད་པའི་དུས་འདི་ལྟ་བུ་ལ་དགེ་བའི་ལམ་ངེས་པ་འདི་ལྟ་བུ་ལ་ཞུགས་པའི་རྗེས་སུ་འཇུག་པར་མི་བྱེད་པ་གང་ཡིན་པ་དེ་ནི་དེ་རྣམས་ཀྱི་རྒྱུན་ཆད་པར་བྱེད་པ་ཡིན། དེ་ནི་དེ་རྣམས་ཀྱི་སྐྱེས་བུ་ཐ་ཤལ་ཡིན་ནོ།
en: My son, he who does not let such a virtuous and sure path, once introduced at such a time as when there were good men, increase will be the one who breaks their tradition, and will be an inferior man among them.

source: །དེ་ལྟ་བས་ན་ང་ཁྱོད་ལ་དེ་སྐད་དུ་ཅི་ནས་ཀྱང་ཁྱོད་ཀྱིས་དགེ་བའི་ལམ་ངེས་པ་འདི་ལྟ་བུ་ལ་ཞུགས་པའི་རྗེས་སུ་འཇུག་པར་བྱ་ཞིང་།
en: Therefore I am saying to you to complete such a virtuous and sure path introduced by me. You should not break the tradition.

source: རྒྱུན་འཆད་པར་མི་བྱ་ཞིང་སྐྱེས་བུ་ཐ་ཤལ་དུ་གྱུར་པར་མི་བྱའོ་ཞེས་སྨྲའོ།
en: You should not be an inferior man.’

source: །དེ་ནས་རྒྱལ་པོ་ལྷ་ཆེན་པོས་གཞོན་ནུ་ཐུ་བོ་རྒྱལ་སྲིད་ཀྱི་དབང་ཕྱུག་ལ་དབང་བྱེད་དུ་བཅུག་ནས་ཡུལ་བཅོམ་བརླག་འདི་ཉིད་ཀྱི་ལྷ་ཆེན་པོའི་ཨ་མྲའི་ཚལ་འདི་ཉིད་དུ་རྒྱལ་པོའི་དྲང་སྲོང་གི་ཚངས་པར་སྤྱོད་པ་སྤྱད་དོ།
en: “Thereupon King Mahādeva put his eldest son upon the throne and led the pure life of a royal ṛṣi in the mango grove of Mahādeva here, in Mithilā.

source: །རྒྱལ་པོ་ལྷ་ཆེན་པོའི་གཞོན་ནུ་ཐུ་བོ་རྒྱལ་སྲིད་ཀྱི་དབང་ཕྱུག་ལ་དབང་བྱེད་དུ་བཅུག་པ་གང་ཡིན་པ་དེ་ཡང་རྒྱལ་པོ་ལྷ་ཆེན་པོ་ཞེས་བྱ་བ་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་མཐའ་བཞིར་རྣམ་པར་རྒྱལ་བ་ཞེས་བྱ་བ་ནས་གནས་སོ་ཞེས་བྱ་བའི་བར་གོང་མ་བཞིན་ནོ།
en: “The eldest son who was put upon the throne was also named Mahādeva, a wheel-turning king who had conquered the border regions in the four directions . . . .

source: །དེ་ནས་རྒྱལ་པོ་ལྷ་ཆེན་པོའི་སྐྲ་དང་ཁ་སྤུ་དག་སྐྲ་མཁན་གྱི་མིས་འཆོས་པ་ན་ཞེས་བྱ་བ་ནས།
en: Then, when a barber was arranging King Mahādeva’s hair and beard . . . .

source: སྐྱེས་བུ་ཐ་ཤལ་དུ་གྱུར་པར་མི་བྱའོ་ཞེས་བྱ་བའི་བར་གོང་མ་བཞིན་ནོ། །དེ་ནས་རྒྱལ་པོ་ལྷ་ཆེན་པོས་གཞོན་ནུ་ཐུ་བོ་རྒྱལ་སྲིད་ཀྱི་དབང་ཕྱུག་ལ་དབང་བྱེད་དུ་བཅུག་ནས་རྒྱལ་པོའི་དྲང་སྲོང་གི་ཚངས་པར་སྤྱོད་པ་སྤྱོད་དོ།
en: ‘You should not be an inferior man.’ Thereupon that King Mahādeva put his eldest son upon the throne and led the pure life of a royal ṛṣi.

source: །དེ་ལྟར་བུ་དང་ཚ་བོ་དང་ཡང་ཚ་བརྒྱུད་པས་ལྷ་ཆེན་པོ་བརྒྱད་ཁྲི་བཞི་སྟོང་གིས་རྒྱལ་པོའི་དྲང་སྲོང་གི་ཚངས་པར་སྤྱོད་པ་སྤྱད་དོ།
en: Likewise, his son, grandson, great-grandson, and eighty-four thousand Mahādevas in succession led the pure life of a royal ṛṣi.

source: །དེ་ནས་རྒྱལ་པོ་ལྷ་ཆེན་པོས་བདག་ཉིད་ཀྱི་མཆོད་སྦྱིན་ཕུན་སུམ་ཚོགས་པ་མཐོང་ནས་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ།
en: “Having seen the perfection of his offerings, King Mahādeva spoke some verses:

source: ལྷ་དང་མི་ཡི་ནང་དག་ཏུ། །དབང་ཕྱུག་དོན་དུ་གཉེར་བ་དང་། །དབུལ་བའི་འཇིགས་པས་སྐྲག་པ་ཡིས།
en: “ ‘Among gods and humans One who seeks kingship And fears poverty

source: །ཅི་ནུས་ཀྱིས་ནི་སྦྱིན་པ་གཏང་།
en: Gives as many donations as possible.

source: །འཇིག་རྟེན་ན་ནི་སྦྱིན་བྱེད་མཆོད།
en: “ ‘One who gives donations is venerated in this world;

source: །སྦྱིན་བྱེད་ལྷ་ཡི་ནང་མཆོད་དེ།
en: One who gives donations is venerated among the gods.

source: །བྱ་ཡི་འབྲས་ལྡན་ཤིང་བཞིན་དུ།
en: Just like a fruit tree to birds,

source: །འབྱུང་པོ་ཀུན་གྱི་སྐྱབས་འོས་ཡིན།
en: He is the refuge of all living things.’

source: །རྒྱལ་པོ་ཆེན་པོ་དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོ་ལྷ་ཆེན་པོ་ཞེས་བྱ་བ་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་གང་གིས་དགེ་བའི་ལམ་ངེས་པ་དེ་སྲོལ་བཏོད་ཅིང་དགེ་བའི་ལམ་ངེས་པ་སྲོལ་བཏོད་པ་དེ་ལ་བརྟེན་ནས་ལྷ་ཆེན་པོ་བརྒྱད་ཁྲི་བཞི་སྟོང་གིས་རྒྱལ་པོའི་དྲང་སྲོང་གི་ཚངས་པར་སྤྱོད་པ་སྤྱད་པ་དེ་གཞན་ཞིག་ཡིན་སྙམ་ན། ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟ་སྟེ།
en: “Great King, if you think that the one who was that wheel-turning king named Mahādeva, who established that virtuous and sure path so that on the basis of the virtuous and sure path eighty-four thousand Mahādevas led the pure life of a royal ṛṣi, at that time, on that occasion, was someone else, you should think otherwise.

source: ང་ཉིད་དེའི་ཚེ་དེའི་དུས་ན་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་ལྷ་ཆེན་པོ་ཞེས་བྱ་བར་གྱུར་ཏེ། ང་ཉིད་ཀྱིས་དགེ་བའི་ལམ་ངེས་པ་དེ་སྲོལ་བཏོད་ཅིང་དགེ་བའི་ལམ་ངེས་པ་སྲོལ་བཏོད་པ་དེ་ལ་བརྟེན་ནས་ལྷ་ཆེན་པོ་བརྒྱད་ཁྲི་བཞི་སྟོང་གི་རྒྱལ་པོའི་དྲང་སྲོང་གི་ཚངས་པར་སྤྱོད་པ་སྤྱད་དོ།
en: I was the wheel-turning king named Mahādeva at that time, on that occasion, and none but I established that virtuous and sure path, so that on the basis of the virtuous and sure path eighty-four thousand Mahādevas led the pure life of a royal ṛṣi.

source: །རྒྱལ་པོ་ཆེན་པོ་ངས་སྦྱིན་པའམ་སྦྱིན་པའི་བགོ་བཤའ་དེས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཐོབ་བོ་སྙམ་ན། ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟ་སྟེ།
en: “Great King, if you think that I attained supreme and complete awakening by these donations or distributions of donations, you should think otherwise;

source: བསོད་ནམས་དག་བྱས་པ་གང་ཡིན་པ་དེ་ཉོན་ཅིག །རྒྱལ་པོ་ཆེན་པོ་སྔོན་བྱུང་བ་ཡུལ་མི་ཐི་ལ་འདི་ཉིད་དུ་དེ་རྣམས་ཀྱི་ཐ་མ་ཤོས་རྒྱལ་པོ་མུ་ཁྱུད་ཅེས་བྱ་བ་ཆོས་ཀྱི་རྒྱལ་པོ་ཆོས་དང་ལྡན་པ་ཆོས་ལ་གནས་པའི་རྒྱལ་པོ་ཞིག་བྱུང་སྟེ།
en: Listen to that story. “Great King, once in this Mithilā there appeared a king named Nimi who was the last in his royal line, a righteous Dharma king who abided in the Dharma.

source: དེ་བཙུན་མོ་དང་། གཞོན་ནུ་དང་། བློན་པོ་དང་། ཁྲོམ་གྱི་རུ་པ་དང་། གྲོང་མི་དང་། ཡུལ་མི་རྣམས་དང་ལྷན་ཅིག་ཏུ་ཆོས་སྤྱོད་ཅིང་སྦྱིན་པ་དག་གཏོང་། བསོད་ནམས་དག་བྱེད་པ། བསྙེན་གནས་ལ་ཉེ་བར་གནས་པ། ཚུལ་ཁྲིམས་ཡང་དག་པར་བླངས་ཏེ་གནས་སོ།
en: With his consorts, sons, ministers, army, citizens, and provincial dwellers, he practiced the Dharma, gave donations, made merit, practiced abstinence, and practiced moral conduct correctly.

source: །དེའི་ཚེ་ལྷ་རྣམས་ཀྱི་དབང་པོ་བརྒྱ་བྱིན་སུམ་བཅུ་རྩ་གསུམ་པའི་ལྷ་རྣམས་ཀྱི་གུང་ལ་ལྷ་རྣམས་ཀྱི་འདུན་ས་ཆོས་བཟང་དུ་ཚོགས་ཤིང་ལྷགས་པ་རྣམས་ལ་བསྔགས་པ་རྗོད་དེ།
en: “At that time, Śakra, Lord of the Gods, praised the king in the presence of the Thirty-Three Gods, who were sitting together in the divine meeting hall, Sudharmā:

source: གྲོགས་པོ་དག་ལུས་འཕགས་ཀྱི་མི་རྣམས་ཀྱི་རྙེད་པ་ནི་ལེགས་པར་རྙེད་དེ། ལུས་འཕགས་ཀྱི་མི་དེ་རྣམས་ཀྱི་རྒྱལ་པོ་མུ་ཁྱུད་ནི་ཆོས་ཀྱི་རྒྱལ་པོ་ཆོས་དང་ལྡན་པ་ཆོས་ལ་གནས་པའི་རྒྱལ་པོ་ཆེན་པོ་ཡིན་ཏེ།
en: ‘O my friends, the people of Videha have attained a great boon, for Nimi, the king of the people of Videha, is a righteous Dharma king, a great king who abides in the Dharma.

source: དེ་བཙུན་མོ་དང་ཞེས་བྱ་བ་ནས་ལྷན་ཅིག་ཏུ་ཆོས་སྤྱོད་ཅིང་ཚུལ་ཁྲིམས་ཡང་དག་པར་བླངས་ཏེ་གནས་སོ་ཞེས་བྱ་བའི་བར་གོང་མ་བཞིན་ནོ།
en: With his consorts . . . he practices the Dharma . . . and practices moral conduct correctly.

source: ཀཽ་ཤི་ཀ་མཆོག་ཏུ་འཚལ་ལོ།
en: “ ‘O Kauśika, we sincerely wish to do so.’

source: །གྲོགས་པོ་དག་དེའི་ཕྱིར་ཁྱེད་ཅག་སྡོད་ཅིག་དང་ཁོ་བོས་ཇེ་རྒྱལ་པོ་མུ་ཁྱུད་བརྟག་པར་བྱའོ།
en: “ ‘Then, my friends, wait here. I will see King Nimi briefly.’

source: །དེ་ནས་ལྷ་རྣམས་ཀྱི་དབང་པོ་བརྒྱ་བྱིན་དཔེར་ན་སྐྱེས་བུ་མཐུ་དང་ལྡན་པའི་ལག་པ་བསྐུམ་པ་ལས་བརྐྱང་བའམ། བརྐྱང་བ་ལས་བསྐུམ་པ་ཙམ་གྱིས་ལྷ་རྣམས་ཀྱི་དབང་པོ་བརྒྱ་བྱིན་སུམ་བཅུ་རྩ་གསུམ་པའི་ལྷ་རྣམས་ཀྱི་ནང་ནས་མི་སྣང་བར་གྱུར་ཏེ། མི་ཐི་ལར་རྒྱལ་པོ་མུ་ཁྱུད་ལྡན་གྱི་ཁང་བཟངས་སུ་ཕྱིན་ནས་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: “Thereupon Śakra, Lord of the Gods, disappeared from the presence of the Thirty-Three Gods, as quickly as a strong man stretches his bent arm or bends his stretched arm, and arrived at King Nimi’s palace in Mithilā.

source: །མུ་ཁྱུད་ལྡན་ཁྱོད་ཀྱི་རྙེད་པ་ནི་ལེགས་པར་རྙེད་དེ། གང་གི་ཕྱིར་སུམ་བཅུ་རྩ་གསུམ་པའི་ལྷ་རྣམས་ལྷའི་འདུན་ས་ཆོས་བཟང་དུ་ཚོགས་ཤིང་འདུས་པ་རྣམས་ཁྱོད་ཀྱི་བསྔགས་པ་རྗོད་པར་བྱེད་ཅིང་།
en: He said, ‘O Nimi, you have attained a great boon, for the Thirty-Three Gods, sitting together in the divine meeting hall, Sudharmā, have praised you:

source: གྲོགས་པོ་དག་ལུས་འཕགས་ཀྱི་མི་རྣམས་ཀྱི་རྙེད་པ་ཞེས་བྱ་བ་ནས་ཚུལ་ཁྲིམས་ཡང་དག་པར་བླངས་ཏེ་གནས་སོ་ཞེས་བྱ་བའི་བར་གོང་མ་བཞིན་ནོ། །མུ་ཁྱུད་ཁྱོད་སུམ་བཅུ་རྩ་གསུམ་པའི་ལྷ་རྣམས་ལྟ་ཞིང་འགྲོ་འདོད་དམ།
en: “O my friends, the people of Videha . . . . He . . . practices moral conduct correctly.” O Nimi, do you want to go to see the Thirty-Three Gods?’

source: ཀཽ་ཤི་ཀ་བདག་སུམ་བཅུ་རྩ་གསུམ་པའི་ལྷ་རྣམས་ལ་ལྟ་ཞིང་མཆི་འཚལ་ལོ།
en: “ ‘O Kauśika, I do wish to go see the Thirty-Three Gods.’

source: །མུ་ཁྱུད་ཁྱོད་དེའི་ཕྱིར་སྡོད་ཅིག །ཁོ་བོས་ཇེ་ཅང་ཤེས་སྟོང་ལྡན་གྱི་ཤིང་རྟ་ཁྱོད་ལ་བསྐུར་གྱིས།
en: “ ‘Then, Nimi, wait here. I will shortly send you a chariot drawn by a thousand fine horses.

source: དེར་ཁྱོད་ཞུགས་ལ་མ་གཡོ་བར་ཤོག་ཤིག །རྒྱལ་པོ་མུ་ཁྱུད་ཀྱིས་དེ་བཞིན་དུ་འཚལ་ལོ་ཞེས་ལྷ་རྣམས་ཀྱི་དབང་པོ་བརྒྱ་བྱིན་ལས་མཉན་ཏོ།
en: You should ride in it and come without fear.’ “ ‘I shall do so,’ replied King Nimi to Śakra, Lord of the Gods.

source: །དེ་ནས་ལྷ་རྣམས་ཀྱི་དབང་པོ་བརྒྱ་བྱིན་སུམ་བཅུ་རྩ་གསུམ་པའི་ལྷ་རྣམས་ཀྱི་ནང་དུ་སོང་ནས་ཁ་ལོ་སྒྱུར་བ་མ་ལ་གདུ་ལ་སྨྲས་པ། མ་ལ་གདུ་ཁྱོད་སོང་ལ་ཅང་ཤེས་སྟོང་ལྡན་གྱི་ཤིང་རྟ་མྱུར་དུ་ཆོས་ལ་རྒྱལ་པོ་མུ་ཁྱུད་གང་ན་བ་དེར་སོང་སྟེ་ཕྱིན་ནས་འདི་སྐད་ཅེས།
en: “Thereupon Śakra, Lord of the Gods, went to the Thirty-Three Gods and ordered Mātali, a charioteer, ‘Mātali, go and very quickly prepare a chariot with a thousand fine horses. Go to King Nimi and say, “O Nimi, this is the chariot drawn by a thousand fine horses sent to you by Śakra, Lord of the Gods.

source: མུ་ཁྱུད་ཁྱོད་ལ་ལྷ་རྣམས་ཀྱི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་ཅང་ཤེས་སྟོང་ལྡན་གྱི་ཤིང་རྟ་བསྐུར་བ་འདི་ཡིན་གྱིས་དེར་ཁྱོད་ཞུགས་ལ་མ་གཡོ་བར་ཤོག་ཤིག་ཅེས་བྱོས་ཤིག །ཀཽ་ཤི་ཀ་ཁྱོད་ཀྱིས་གསུངས་པས་ཤིན་དུ་མ་ནོངས་སོ་ཞེས་ཁ་ལོ་སྒྱུར་བ་མ་ལ་གདུས་ལྷ་རྣམས་ཀྱི་དབང་པོ་བརྒྱ་བྱིན་ལས་མཉན་ནས་མྱུར་དུ་ཅང་ཤེས་སྟོང་ལྡན་གྱི་ཤིང་རྟ་བཅས་ཏེ། རྒྱལ་པོ་མུ་ཁྱུད་གང་ན་བ་དེར་སོང་ནས་ཕྱིན་པ་དང་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: Come, ride in it without fear.” ’ “ ‘O Kauśika, what you instructed will be carried out without any mistake,’ replied the charioteer Mātali to Śakra, Lord of the Gods. He prepared very quickly a chariot with a thousand fine horses and went to King Nimi.

source: །མུ་ཁྱུད་ཁྱོད་ལ་ལྷ་རྣམས་ཀྱི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་ཅང་ཤེས་སྟོང་ལྡན་གྱི་ཤིང་རྟ་བསྐུར་བ་འདི་ཡིན་གྱིས་འདིར་ཁྱོད་ཞུགས་ལ་མ་གཡོ་བར་ཤོག་ཤིག་ཅེས་མཆིའོ།
en: When he arrived, he said, ‘O Nimi, this is the chariot drawn by a thousand fine horses sent to you by Śakra, Lord of the Gods. Come, ride in it without fear.’

source: །རྒྱལ་པོ་ཆེན་པོ་རྒྱལ་པོ་མུ་ཁྱུད་ཅང་ཤེས་སྟོང་ལྡན་གྱི་ཤིང་རྟར་ཞུགས་པ་དང་། དེ་ནས་ཁ་ལོ་སྒྱུར་བ་མ་ལ་གདུས་རྒྱལ་པོ་མུ་ཁྱུད་ལ་སྨྲས་པ།
en: “King Nimi rode the chariot drawn by a thousand fine horses without fear.

source: ཁྱོད་ཀྱི་ཤིང་རྟ་གང་ནས་དྲང་། གང་ན་སེམས་ཅན་སྡིག་པའི་ལས་ཅན་རྣམས་སྡིག་པ་མི་དགེ་བའི་ལས་ཀྱི་རྣམ་པར་སྨིན་པ་ཉམས་སུ་མྱོང་བ་ནས་སམ། གང་ན་སེམས་ཅན་དགེ་བའི་ལས་ཅན་རྣམས་ལས་དགེ་བའི་རྣམ་པར་སྨིན་པ་ཉམས་སུ་མྱོང་བ་ནས་དྲང་།
en: Then the charioteer Mātali asked King Nimi, ‘Along which side shall I drive your chariot, the side where beings of evil karma experience the maturation of evil and nonvirtuous karma, or the side where beings of virtuous karma experience the maturation of virtuous karma?’

source: མ་ལ་གདུ་དེའི་ཕྱིར་གང་ན་སེམས་ཅན་སྡིག་པའི་ལས་ཅན་རྣམས་སྡིག་པ་མི་དགེ་བའི་རྣམ་པར་སྨིན་པ་ཉམས་སུ་མྱོང་བ་ཡོད་པ་དང་། གང་ན་སེམས་ཅན་དགེ་བའི་ལས་ཅན་རྣམས་ལས་དགེ་བའི་རྣམ་པར་སྨིན་པ་ཉམས་སུ་མྱོང་བ་དག་ཡོད་པ་གཉིས་ཀ་བལྟས།
en: “ ‘In this case, Mātali, drive the chariot in a way that will enable me to see both, the side where beings of evil karma experience the maturation of evil and nonvirtuous karma, and the side where beings of virtuous karma experience the maturation of virtuous karma.’

source: དེ་དག་གང་ན་བ་དེ་ལོགས་སུ་ཤིང་རྟ་དྲོངས་ཤིག །དེ་ནས་ཁ་ལོ་སྒྱུར་བ་མ་ལ་གདུས་རྒྱལ་པོ་མུ་ཁྱུད་ཀྱིས་ཅི་ནས་ཀྱང་གང་ན་སེམས་ཅན་སྡིག་པའི་ལས་ཅན་རྣམས་སྡིག་པ་མི་དགེ་བའི་ལས་ཀྱི་རྣམ་པར་སྨིན་པ་ཉམས་སུ་མྱོང་བ་ཡོད་པ་དང་། གང་ན་སེམས་ཅན་དགེ་བའི་ལས་ཅན་རྣམས་ལས་དགེ་བའི་རྣམ་པར་སྨིན་པ་ཉམས་སུ་མྱོང་བ་ཡོད་པ་གཉི་ག་མཐོང་བར་འགྱུར་བ་དེ་ལྟར་རྒྱལ་པོ་མུ་ཁྱུད་ལྡན་གྱི་ཤིང་རྟ་དྲངས་སོ།
en: “Thereupon the charioteer Mātali drove King Nimi’s chariot in a way that enabled King Nimi to see both, the side where beings of evil karma experience the maturation of evil and nonvirtuous karma, and the side where beings of virtuous karma experience the maturation of virtuous karma.

source: །རྒྱལ་པོ་མུ་ཁྱུད་སུམ་བཅུ་རྩ་གསུམ་པའི་ལྷ་རྣམས་ཀྱི་ནང་དུ་ཕྱིན་ནས་རྒྱལ་པོ་མུ་ཁྱུད་ལྷ་རྣམས་ཀྱི་འདུན་ས་ཆོས་བཟང་དུ་ཞུགས་པ་དང་། ལྷ་རྣམས་ཀྱི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་རྒྱལ་པོ་མུ་ཁྱུད་ལ་སྟན་ཕྱེད་བསྟབས་ནས་རྒྱལ་པོ་མུ་ཁྱུད་དང་ལྷ་རྣམས་ཀྱི་དབང་པོ་བརྒྱ་བྱིན་སྟན་ཕྱེད་ཕྱེད་ལ་འདུག་གོ།
en: “King Nimi went to the Thirty-Three Gods and sat in the Thirty-Three Gods’ divine meeting hall, Sudharmā. Śakra, Lord of the Gods, offered half of his seat to King Nimi; King Nimi and Śakra, Lord of the Gods, sat on both halves of the same seat.

source: །རྒྱལ་པོ་ཆེན་པོ་རྒྱལ་པོ་མུ་ཁྱུད་དང་ལྷ་རྣམས་ཀྱི་དབང་པོ་བརྒྱ་བྱིན་སྟན་ཕྱེད་ཕྱེད་ལ་འདུག་པ་ན་ཁྱད་པར་རམ། བསམ་པའམ། ཐ་དད་དུ་བྱ་བ་ཅུང་ཟད་ཀྱང་མེད་དེ། གཞན་དུ་ན་ལྷ་རྣམས་ཀྱི་དབང་པོ་བརྒྱ་བྱིན་ནི་མིག་མི་འཛུམས་པར་ཟད་དོ།
en: “When King Nimi and Śakra, Lord of the Gods, sat on both halves of the same seat, there was no difference, no distinction, and no contrast between them, except that Śakra, Lord of the Gods, did not blink his eyes.

source: །དེ་ནས་རྒྱལ་པོ་མུ་ཁྱུད་ཀྱིས་བདག་ཉིད་ཀྱི་མཆོད་སྦྱིན་ཕུན་སུམ་ཚོགས་པ་མཐོང་ནས་དེའི་ཚེ་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ།
en: “Then, having seen the perfection of his offerings, King Nimi spoke this verse: “ ‘Those who act carelessly,

source: དགེ་ལས་བྱས་དང་དེ་བཞིན་དུ།
en: Having seen those who have created virtuous karma

source: །མི་དགེའི་ལས་བྱས་མཐོང་ནས་ནི། །མི་གང་བག་མེད་བྱེད་པ་དེ།
en: And ones of unwholesome karma,

source: །སྐྱེས་བུ་ཐ་ཤལ་སྙིང་རེ་རྗེ།
en: Are the worst—they’re deplorable people.’

source: །དེ་ནས་ལྷ་རྣམས་ཀྱི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་རྒྱལ་པོ་མུ་ཁྱུད་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །མུ་ཁྱུད་ཁྱོད་འདི་ཉིད་དུ་འདུག་ལ་དགའ་བར་སྤྱོད་ཅིག །འདོད་པའི་ཡོན་ཏན་ལྔ་འབྱོར་ཅིང་ལྡན་པས་རྩེད་མོ་བྱོས་ཤིག །དགའ་བར་སྤྱོད་ཅིག །དགའ་མགུར་སྤྱོད་ཅིག །དེས་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ།
en: “Thereupon Śakra, Lord of the Gods, said to King Nimi, ‘O Nimi, you should stay here and amuse yourself. Play, amuse yourself, and enjoy yourself, enjoying the objects of the five kinds of desires.’ “The king then spoke these verses: “ ‘This place, which is Under the rule of others, is

source: ཇི་ལྟར་སྣོད་དང་ཤིང་རྟ་དག །བརྙས་པ་རེ་ཞིག་དུས་ཡིན་ལྟར།
en: Like a vessel and a chariot Borrowed only for a while.

source: །དེ་དང་འདྲ་བར་གནས་འདི་ཡང་། །དབང་ནི་གཞན་དག་སྒྱུར་བས་བདག །འདི་ནས་མི་ཐི་ལར་སོང་ནས།
en: “ ‘I will return to Mithilā from here

source: །དགེ་བ་མང་པོ་རྣམས་བྱ་ཞིང་།
en: And perform many good deeds.

source: །བསོད་ནམས་ཕུན་སུམ་ཚོགས་བྱས་ནས།
en: Having perfected merit,

source: །དེ་ནས་མཐོ་རིས་འོང་བར་བྱ།
en: I will come to heaven.’

source: །དེ་མི་ཐི་ལར་འོངས་ནས་སྦྱིན་པ་དག་བཏང་། བསོད་ནམས་དག་བྱས་ནས་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ།
en: “When he had gone back to Mithilā, he gave donations and made merit, and he spoke some other verses: “ ‘Good people praise the donations

source: གང་ཚེ་རྒྱལ་རིགས་བྲམ་ཟེ་དང་། །རྗེའུ་རིགས་དམངས་རིགས་གདོལ་པ་དང་། །ཀླ་ཀློ་ཕོངས་ལ་བྱིན་པ་ཡི།
en: Given to kṣatriyas, brahmins, Vaiśyas, śūdras, caṇḍālas,

source: །སྦྱིན་པ་དམ་པ་རྣམས་ཀྱིས་བསྔགས།
en: And poor pukkasas.

source: །མུ་གེའི་ཚེ་ན་སྦྱིན་བྱིན་ཞིང་།
en: “ ‘Having given donations in a time of famine

source: །སྐྱེ་བོ་དམ་པ་ཚིམ་བྱས་ནས།
en: And satisfied good people,

source: །ངན་སོང་རྣམས་སྤངས་འདི་དང་ནི།
en: They avoid inferior states of existence

source: །མཐོ་རིས་སུ་ཡང་བཀུར་བ་ཡིན།
en: And are venerated in this world and in heaven.

source: །ཕན་ཡོན་འདི་ནི་ཤེས་ནས་ཀྱང་།
en: “ ‘Knowing this benefit,

source: །མཁས་པ་རྣམས་ཀྱིས་སྦྱིན་པ་གཏང་།
en: Wise men give donations.

source: །སྦྱིན་པ་ཡིས་ནི་ཐར་པ་དང་། །དབང་ཕྱུག་ལྷ་གནས་འབྱོར་བར་འགྱུར།
en: By donations, they attain liberation, Power, and the palace of the gods.’

source: །རྒྱལ་པོ་ཆེན་པོ་དེའི་ཚེ་དེའི་དུས་ན་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་མུ་ཁྱུད་ཅེས་བྱ་བ་གང་གིས་སུམ་བཅུ་རྩ་གསུམ་པའི་ལྷ་རྣམས་ཀྱི་ནང་དུ་སོང་ནས་ལྷ་རྣམས་ཀྱི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་སྟན་ཕྱེད་དང་། ལྷ་རྣམས་ཀྱི་འདོད་པའི་ཡོན་ཏན་ལྔས་བསྟབས་ནས། དེས་མི་ཐི་ལར་འོངས་ཏེ་གྲོང་ཁྱེར་གྱི་སྒོ་བཞིར་མཆོད་སྦྱིན་གྱི་གནས་བརྩིགས་ནས་སྦྱིན་པ་དག་བཏང་། བསོད་ནམས་དག་བྱས་པ་དེ་གཞན་ཞིག་ཡིན་སྙམ་ན་ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟ་སྟེ།
en: “Great King, if you think that the one who was that wheel-turning king Nimi, who went to the Thirty-Three Gods, was given by Śakra, Lord of the Gods, half of his seat and divine objects of the five kinds of desires, came back to Mithilā, built places for offerings at the four gates of the city, gave donations, and made merit, was someone else, you should think otherwise.

source: འོན་ཀྱང་ང་ཉིད་དེའི་ཚེ་དེའི་དུས་ན་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་མུ་ཁྱུད་ཅེས་བྱ་བ་གང་གིས་སུམ་བཅུ་རྩ་གསུམ་པའི་ལྷ་རྣམས་ཀྱི་ནང་དུ་སོང་ནས་ལྷ་རྣམས་ཀྱི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་སྟན་ཕྱེད་དང་ལྷ་རྣམས་ཀྱི་འདོད་པའི་ཡོན་ཏན་ལྔས་བསྟབས་པ་ཡིན་པར་གྱུར་ཏེ། ང་ཉིད་དེ་ནས་མི་ཐི་ལར་སོང་ནས་གྲོང་ཁྱེར་གྱི་སྒོ་བཞིར་མཆོད་སྦྱིན་གྱི་གནས་བརྩིགས་ཏེ་སྦྱིན་པ་དག་བྱིན། བསོད་ནམས་དག་བྱས་སོ།
en: I was the wheel-turning king Nimi at that time, on that occasion, who went to the Thirty-Three Gods, was given by Śakra, Lord of the Gods, half of his seat and divine objects of the five kinds of desires, came back to Mithilā, built places for offerings at the four gates of the city, gave donations, and made merit.

source: །རྒྱལ་པོ་ཆེན་པོ་ངས་སྦྱིན་པའམ་སྦྱིན་པའི་བགོ་བཤའ་དེས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཐོབ་བོ་སྙམ་ན་ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟ་སྟེ།
en: “Great King, if you think that I attained supreme and complete awakening by these donations or distributions of donations, you should think otherwise;

source: །དེའི་འོག་ཏུ་རྒྱལ་པོ་ཀུན་དགའ་བོ་ཞེས་བྱ་བ་མཐུ་དང་ལྡན་པ་ཞེས་བྱ་བའི་བར་དུ་རྒྱས་པར་སྦྱར་ཏེ།
en: “After him (Nimi), there was a mighty king named Ānanda . . . .

source: དེ་ལ་བུ་གཅིག་དང་གཉིས་ནས་ལྔའི་བར་དག་བཙས་པ་ལས་དེའི་བུ་ཐ་ཆུངས་གང་ཡིན་པ་དེའི་གདོང་མེ་ལོང་འདྲ་བས་དེའི་མིང་མེ་ལོང་གདོང་ཞེས་བྱ་བར་གྲགས་སོ།
en: One, two, . . . five sons were born to him. The youngest son’s face (mukha) resembled a mirror (ādarśa), and so he was named Ādarśamukha.

source: །དེ་དག་ཐམས་ཅད་བསྲིངས་བསྐྱེད་དེ་ཆེན་པོར་གྱུར་ཏོ།
en: All these sons were raised and grew up.
